

// Простір назв групує пов'язані типи цього модуля в одному місці

namespace CLARITY.music.Api.Domain;




// Клас нижче описує сутність або правило предметної області
public class Genre
{
    // Властивість нижче зберігає значення яке читають інші частини системи
    public int Id { get; set; }
    // Властивість нижче зберігає значення яке читають інші частини системи
    public string Name { get; set; } = string.Empty;

    // Властивість нижче зберігає значення яке читають інші частини системи
    public List<Track> Tracks { get; set; } = new();
}
