

// Простір назв групує пов'язані типи цього модуля в одному місці

namespace CLARITY.music.Api.DTOs;




// Клас нижче описує форму даних для обміну між шарами застосунку
public class TrackMutationResultDto
{
    // Властивість нижче зберігає значення яке читають інші частини системи
    public int Id { get; set; }
    // Властивість нижче зберігає значення яке читають інші частини системи
    public bool IsActive { get; set; }
    // Властивість нижче зберігає значення яке читають інші частини системи
    public bool Updated { get; set; }
    // Властивість нижче зберігає значення яке читають інші частини системи
    public bool Deleted { get; set; }
    // Властивість нижче зберігає значення яке читають інші частини системи
    public TrackDto? Track { get; set; }
}
